"""База молекул: молярные массы (г/моль) и число атомов углерода."""

COMPONENT_DB = {
    # распространённые углеводороды и инертные
    "CH4": {"M": 16.04, "nC": 1},
    "C2H6": {"M": 30.07, "nC": 2},
    "C3H8": {"M": 44.096, "nC": 3},
    "C4H10": {"M": 58.12, "nC": 4},   # бутаны (норм./изо) ~ одинаковы по М и nC
    "C5H12": {"M": 72.15, "nC": 5},
    "C6H14": {"M": 86.17, "nC": 6},
    "C7H16": {"M": 100.20, "nC": 7},
    "C8H18": {"M": 114.23, "nC": 8},
    "C9H20": {"M": 128.26, "nC": 9},
    "C10H22": {"M": 142.29, "nC": 10},
    "C11H24": {"M": 156.32, "nC": 11},
    "C12H26": {"M": 170.35, "nC": 12},
    "CO2": {"M": 44.011, "nC": 1},
    "N2": {"M": 28.0134, "nC": 0},
    "O2": {"M": 31.9988, "nC": 0},
    "H2": {"M": 2.01588, "nC": 0},
    "He": {"M": 4.0026, "nC": 0},
    "Ar": {"M": 39.948, "nC": 0},
    # можно дополнять
}