"""База молекул: молярные массы (г/моль) и число атомов углерода."""

COMPONENT_DB = {
    # углеводороды
    "CH4":  {"M": 16.04,   "nC": 1, "name": "Метан"},
    "C2H6": {"M": 30.07,   "nC": 2, "name": "Этан"},
    "C3H8": {"M": 44.096,  "nC": 3, "name": "Пропан"},
    "n-C4H10": {"M": 58.12,  "nC": 4, "name": "Н-бутан"},
    "i-C4H10": {"M": 58.12,  "nC": 4, "name": "Изо-бутан"},
    "n-C5H12": {"M": 72.15,  "nC": 5, "name": "Н-пентан"},
    "i-C5H12": {"M": 72.15,  "nC": 5, "name": "Изо-пентан"},
    "C5H12": {"M": 72.15,  "nC": 5, "name": "нео-Пентан"},
    "C6H14": {"M": 86.17,  "nC": 6, "name": "Гексан"},
    "C7H16": {"M": 100.20, "nC": 7, "name": "Гептан"},
    "C8H18": {"M": 114.23, "nC": 8, "name": "Октан"},
    "C9H20": {"M": 128.26, "nC": 9, "name": "Нонан"},
    "C10H22": {"M": 142.29, "nC": 10, "name": "Декан"},
    "C11H24": {"M": 156.32, "nC": 11, "name": "Ундекан"},
    "C12H26": {"M": 170.35, "nC": 12, "name": "Додекан"},

    # другие компоненты
    "CO2": {"M": 44.011,  "nC": 1, "name": "Диоксид углерода"},
    "N2":  {"M": 28.0134, "nC": 0, "name": "Азот"},
    "O2":  {"M": 31.9988, "nC": 0, "name": "Кислород"},
    "H2":  {"M": 2.01588, "nC": 0, "name": "Водород"},
    "He":  {"M": 4.0026,  "nC": 0, "name": "Гелий"},
    "Ar":  {"M": 39.948,  "nC": 0, "name": "Аргон"},
}